perturbations_study/no_perts/0.original/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../setUp"

 
dimensions      [0 1 -1 0 0 0 0];
 
//internalField   uniform $U0;
#include "../U0"

boundaryField
{
    lower
    {
        type            velocityABLWallFunction;
        print           true;
        U               U;
        value           uniform (0 0 0);
    }
    upper
    {
        type            timeVaryingMappedFixedValue;
        setAverage      0;
        peturb          1e-05;
        offset          (0 0 0);
        value           uniform (0 0 0);
    }
    west
    {
        type            timeVaryingMappedInletOutlet;
        format          ascii;
        valueFraction   uniform 0;
        refValue        uniform (0 0 0);
    }
    east
    {   
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    south
    {
        type            timeVaryingMappedInletOutlet;
        format          ascii;
        valueFraction   uniform 0;
        refValue        uniform (0 0 0);
    }
    north
    {   
        type            timeVaryingMappedInletOutlet;
        format          ascii;
        valueFraction   uniform 0;
        refValue        uniform (0 0 0);
    }
}



// ************************************************************************* //
